Repository: msysgit/msys
Catalog: msys/packages/findutils/4.3/po/*.po
Languages: pl

source: invalid argument %s for %s
pl: b³êdny argument %s dla %s

source: ambiguous argument %s for %s
pl: niejednoznaczny argument %s dla %s

source: Valid arguments are:
pl: Poprawne argumenty to:

source: Unknown system error
pl: Nieznany b³±d systemowy

source: %s: option `%s' is ambiguous
pl: %s: opcja `%s' jest niejednoznaczna

source: %s: option `--%s' doesn't allow an argument
pl: %s: opcja `--%s' nie mo¿e mieæ argumentu

source: %s: option `%c%s' doesn't allow an argument
pl: %s: opcja `%c%s' nie mo¿e mieæ argumentu

source: %s: option `%s' requires an argument
pl: %s: opcja `%s' wymaga argumentu

source: %s: unrecognized option `--%s'
pl: %s: nierozpoznana opcja `--%s'

source: %s: unrecognized option `%c%s'
pl: %s: nierozpoznana opcja `%c%s'

source: %s: illegal option -- %c
pl: %s: nielegalna opcja -- %c

source: %s: invalid option -- %c
pl: %s: b³êdna opcja -- %c

source: %s: option requires an argument -- %c
pl: %s: opcja wymaga argumentu -- %c

source: %s: option `-W %s' is ambiguous
pl: %s: opcja `-W %s' jest niejednoznaczna

source: %s: option `-W %s' doesn't allow an argument
pl: %s: opcja `-W %s' nie mo¿e mieæ argumentu

source: block size
pl: rozmiar bloku

source: ^[yY]
pl: ^[yYtT]

source: oops -- invalid default insertion of and!
pl: ojej -- b³êdne domy¶lne wstawienie and!

source: Usage: %s [-H] [-L] [-P] [path...] [expression]
pl: Sk³adnia: %s [-H] [-L] [-P] [¶cie¿ka...] [wyra¿enie]

source: The environment variable FIND_BLOCK_SIZE is not supported, the only thing that affects the block size is the POSIXLY_CORRECT environment variable
pl: Zmienna ¶rodowiskowa FIND_BLOCK_SIZE nie jest obs³ugiwana; jedyne, co wp³ywa na rozmiar bloku, to zmienna ¶rodowiskowa POSIXLY_CORRECT

source: paths must precede expression
pl: ¶cie¿ki musz± poprzedzaæ wyra¿enie

source: invalid predicate `%s'
pl: b³êdne wyra¿enie `%s'

source: missing argument to `%s'
pl: brak argumentu dla `%s'

source: invalid argument `%s' to `%s'
pl: b³êdny argument `%s' dla `%s'

source: unexpected extra predicate
pl: nie obs³ugiwane dodatkowe wyra¿enie

source: cannot get current directory
pl: nie mo¿na uzyskaæ bie¿±cego katalogu

source: Warning: filesystem %s has recently been unmounted.
pl: Uwaga: system plików %s zosta³ niedawno odmontowany.

source: Warning: filesystem %s has recently been mounted.
pl: Uwaga: system plików %s zosta³ niedawno zamontowany.

source: %s%s changed during execution of %s (old device number %ld, new device number %ld, filesystem type is %s) [ref %ld]
pl: %s%s zmieni³ siê podczas wykonywania %s (stary numer urz±dzenia %ld, nowy numer urz±dzenia %ld, typ systemu plików to %s) [ref %ld]

source: %s%s changed during execution of %s (old inode number %ld, new inode number %ld, filesystem type is %s) [ref %ld]
pl: %s%s zmieni³ siê podczas wykonywania %s (stary numer i-wêz³a %ld, nowy numer i-wêz³a %ld, typ systemu plików %s) [ref %ld]

source: Symbolic link `%s' is part of a loop in the directory hierarchy; we have already visited the directory to which it points.
pl: Dowi±zanie symboliczne `%s' jest czê¶ci± pêtli w hierarchii katalogów; katalog wskazywany przez to dowi±zanie by³ ju¿ odwiedzony.

source: Filesystem loop detected; `%s' has the same device number and inode as a directory which is %d %s.
pl: Wykryto pêtlê w systemie plików; `%s' ma ten sam numer urz±dzenia i i-wêze³ jak katalog %d %s.

source: level higher in the filesystem hierarchy
pl: poziom wy¿ej w hierarchii systemu plików

source: levels higher in the filesystem hierarchy
pl: poziomów wy¿ej w hierarchii systemu plików

source: warning: not following the symbolic link %s
pl: uwaga: nie pod±¿anie za dowi±zaniem symbolicznym %s

source: WARNING: Hard link count is wrong for %s: this may be a bug in your filesystem driver. Automatically turning on find's -noleaf option. Earlier results may have failed to include directories that should have been searched.
pl: UWAGA: z³a liczba twardych dowi±zañ dla %s: to mo¿e byæ b³±d w sterowniku systemu plików. Automatyczne w³±czenie opcji -noleaf finda. Wcze¶niejsze wyniki mog³y nie zawieraæ katalogów, które powinny byæ przeszukane.

source: unknown
pl: nieznany

source: warning: you have specified the %s option after a non-option argument %s, but options are not positional (%s affects tests specified before it as well as those specified after it). Please specify options before other arguments.
pl: uwaga: podano opcjê %s po argumencie %s nie bêd±cym opcj±, ale opcje nie s± pozycyjne (%s wp³ywa na testy podane przed ni± jak i po niej). Proszê podawaæ opcje przed innymi argumentami.

source: warning: the -d option is deprecated; please use -depth instead, because the latter is a POSIX-compliant feature.
pl: uwaga: opcja -d jest przestarza³a; proszê zamiast niej u¿ywaæ -depth, poniewa¿ ta jest zgodna z POSIX.

source: Usage: %s [path...] [expression]
pl: Sk³adnia: %s [¶cie¿ka...] [wyra¿enie]

source: default path is the current directory; default expression is -print expression may consist of: operators, options, tests, and actions:
pl: domy¶lna ¶cie¿ka to aktualny katalog; domy¶lne wyra¿enie to -print wyra¿enie mo¿e sk³adaæ siê z: operatorów, opcji, testów i akcji:

source: operators (decreasing precedence; -and is implicit where no others are given): ( EXPR ) ! EXPR -not EXPR EXPR1 -a EXPR2 EXPR1 -and EXPR2 EXPR1 -o EXPR2 EXPR1 -or EXPR2 EXPR1 , EXPR2
pl: operatory (malej±cy priorytet; je¶li nie ma ¿adnego, przyjmuje siê -and): ( WYR ) ! WYR -not WYR WYR1 -a WYR2 WYR1 -and WYR2 WYR1 -o WYR2 WYR1 -or WYR2 WYR1 , WYR2

source: positional options (always true): -daystart -follow -regextype normal options (always true, specified before other expressions): -depth --help -maxdepth LEVELS -mindepth LEVELS -mount -noleaf --version -xdev -ignore_readdir_race -noignore_readdir_race
pl: opcje pozycyjne (zawsze prawdziwe): -daystart -follow -regextype opcje zwyk³e (zawsze prawdziwe, podawane przed innymi wyra¿eniami): -depth --help -maxdepth POZIOMY -mindepth POZIOMY -mount -noleaf --version -xdev -ignore_readdir_race -noignore_readdir_race

source: tests (N can be +N or -N or N): -amin N -anewer FILE -atime N -cmin N -cnewer FILE -ctime N -empty -false -fstype TYPE -gid N -group NAME -ilname PATTERN -iname PATTERN -inum N -iwholename PATTERN -iregex PATTERN -links N -lname PATTERN -mmin N -mtime N -name PATTERN -newer FILE
pl: testy (N jest postaci +N lub -N lub N): -amin N -anewer PLIK -atime N -cmin N -cnewer PLIK -ctime N -empty -false -fstype TYP -gid N -group NAZWA -ilname WZORZEC -iname WZORZEC -inum N -iwholename WZORZEC -iregex WZORZEC -links N -lname WZORZEC -mmin N -mtime N -name WZORZEC -newer PLIK

source: actions: -delete -print0 -printf FORMAT -fprintf FILE FORMAT -print -fprint0 FILE -fprint FILE -ls -fls FILE -prune -quit -exec COMMAND ; -exec COMMAND {} + -ok COMMAND ; -execdir COMMAND ; -execdir COMMAND {} + -okdir COMMAND ;
pl: akcje: -delete -print0 -printf FORMAT -fprintf PLIK FORMAT -print -fprint0 PLIK -fprint PLIK -ls -fls PLIK -prune -quit -exec POLECENIE ; -exec POLECENIE {} + -ok POLECENIE ; -execdir POLECENIE ; -execdir POLECENIE {} + -okdir POLECENIE ;

source: Report (and track progress on fixing) bugs via the findutils bug-reporting page at http://savannah.gnu.org/ or, if you have no web access, by sending email to <bug-findutils@gnu.org>.
pl: Proszê zg³aszaæ b³êdy (i ¶ledziæ proces ich naprawiania) poprzez stronê zg³aszania b³êdów w findutils pod adresem http://savannah.gnu.org/ lub, w przypadku braku dostêpu do WWW, wysy³aj±c pocztê elektroniczn± pod adres <bug-findutils@gnu.org>.

source: sanity check of the fnmatch() library function failed.
pl: sprawdzenie poprawno¶ci funkcji bibliotecznej fnmatch() nie powiod³o siê.

source: warning: Unix filenames usually don't contain slashes (though pathnames do). That means that '%s %s' will probably evaluate to false all the time on this system. You might find the '-wholename' test more useful, or perhaps '-samefile'. Alternatively, if you are using GNU grep, you could use 'find ... -print0 | grep -FzZ %s'.
pl: uwaga: uniksowe nazwy plików zwykle nie zawieraj± uko¶ników (ale ¶cie¿ki tak). Oznacza to, ¿e '%s %s' bêdzie prawdopodobnie zawsze fa³szywe na tym systemie. Przydatny mo¿e byæ test '-wholename' albo '-samefile'. Ewentualnie, maj±c GNU grepa, mo¿na u¿yæ 'find ... -print0 | grep -FzZ %s'.

source: warning: the predicate -ipath is deprecated; please use -iwholename instead.
pl: uwaga: wyra¿enie -ipath jest przestarza³e; proszê zamiast niego u¿ywaæ -iwholename.

source: invalid mode `%s'
pl: niew³a¶ciwe uprawnienia `%s'

source: invalid null argument to -size
pl: b³êdny zerowy argument dla -size

source: invalid -size type `%c'
pl: b³êdny typ -size `%c'

source: GNU find version %s
pl: GNU find wersja %s

source: Features enabled:
pl: W³±czone w³a¶ciwo¶ci:

source: warning: unrecognized escape `\%c'
pl: uwaga: nierozpoznany znak steruj±cy `\%c'

source: warning: unrecognized format directive `%%%c'
pl: uwaga: nierozpoznana dyrektywa formatuj±ca `%%%c'

source: The current directory is included in the PATH environment variable, which is insecure in combination with the %s action of find. Please remove the current directory from your $PATH (that is, remove "." or leading or trailing colons)
pl: Bie¿±cy katalog jest obecny w zmiennej ¶rodowiskowej PATH, co jest niebezpieczne w po³±czeniu z akcj± %s polecenia find. Proszê usun±æ bie¿±cy katalog ze zmiennej $PATH (tzn. usun±æ "." albo wiod±ce lub koñcowe dwukropki)

source: You may not use {} within the utility name for -execdir and -okdir, because this is a potential security problem.
pl: Nie mo¿na u¿ywaæ {} wewn±trz nazwy narzêdzia dla opcji -execdir i -okdir, poniewa¿ jest to potencjalny problem z bezpieczeñstwem.

source: Only one instance of {} is supported with -exec%s ... +
pl: Obs³ugiwane jest tylko jedno wyst±pienie {} przy -exec%s ... +

source: cannot fork
pl: nie mo¿na wykonaæ fork

source: error waiting for %s
pl: b³±d podczas czekania na %s

source: %s terminated by signal %d
pl: %s zakoñczony sygna³em %d

source: invalid expression
pl: b³êdne wyra¿enie

source: invalid expression; you have used a binary operator with nothing before it.
pl: b³êdne wyra¿enie; podano operator binarny bez niczego przed nim.

source: invalid expression; you have too many ')'
pl: b³êdne wyra¿enie; za du¿o ')'

source: invalid expression; I was expecting to find a ')' somewhere but did not see one.
pl: b³êdne wyra¿enie; oczekiwano gdzie¶ ')', ale nie znaleziono.

source: oops -- invalid expression type!
pl: ojej -- b³êdny typ wyra¿enia!

source: oops -- invalid expression type (%d)!
pl: ojej -- b³êdny typ wyra¿enia (%d)!

source: oops -- invalid expression type in mark_stat!
pl: ojej -- b³êdny typ wyra¿enia w mark_stat!

source: oops -- invalid expression type in mark_type!
pl: ojej -- b³êdny typ wyra¿enia w mark_type!

source: Usage: %s [--version | --help] or %s most_common_bigrams < file-list > locate-database
pl: Sk³adnia: %s [--version | --help] lub %s najpopularniejsze_bigramy < lista-plików > baza-danych-locate

source: Report bugs to <bug-findutils@gnu.org>.
pl: B³êdy proszê zg³aszaæ na adres <bug-findutils@gnu.org>.

source: GNU findutils version %s
pl: GNU findutils wersja %s

source: days
pl: dni

source: locate database `%s' is corrupt or invalid
pl: baza danych locate `%s' jest uszkodzona lub niepoprawna

source: Locate database size: %s bytes
pl: Rozmiar bazy danych locate: %s bajtów

source: Filenames: %s
pl: Nazwy plików: %s

source: with a cumulative length of %s bytes
pl: o ³±cznej d³ugo¶ci %s bajtów

source: of which %s contain whitespace,
pl: z których %s zawiera odstêpy,

source: %s contain newline characters,
pl: %s zawiera znaki nowej linii,

source: and %s contain characters with the high bit set.
pl: a %s zawiera znaki z ustawionym najstarszym bitem.

source: Compression ratio %4.2f%%
pl: Wspó³czynnik kompresji %4.2f%%

source: warning: the locate database can only be read from stdin once.
pl: uwaga: baza danych locate mo¿e byæ odczytana ze standardowego wej¶cia tylko raz.

source: warning: database `%s' is more than %d %s old
pl: uwaga: baza danych `%s' ma ju¿ ponad %d %s

source: Database %s is in the %s format.
pl: Baza danych %s jest w formacie %s.

source: old
pl: starym

source: Usage: %s [-d path | --database=path] [-e | -E | --[non-]existing] [-i | --ignore-case] [-w | --wholename] [-b | --basename] [--limit=N | -l N] [-S | --statistics] [-0 | --null] [-c | --count] [-P | -H | --nofollow] [-L | --follow] [-m | --mmap ] [ -s | --stdio ] [-A | --all] [-p | --print] [-r | --regex ] [--regextype=TYPE] [-version] [--help] pattern...
pl: Sk³adnia: %s [-d ¶cie¿ka | --database=¶cie¿ka] [-e | -E | --[non-]existing] [-i | --ignore-case] [-w | --wholepath] [-b | --basename] [--limit=N | -l N] [-S | --statistics] [-0 | --null] [-c | --count] [-P | -H | --nofollow] [-L | --follow] [-m | --mmap ] [ -s | --stdio ] [-A | --all] [-p | --print] [-r | --regex ] [--regextype=RODZAJ] [--version] [--help] wzorzec...

source: GNU locate version %s
pl: GNU locate wersja %s

source: argument to --limit
pl: argument dla --limit

source: GNU xargs version %s
pl: GNU xargs wersja %s

source: environment is too large for exec
pl: ¶rodowisko jest zbyt du¿e, aby wykonaæ exec

source: Cannot open input file `%s'
pl: Nie mo¿na otworzyæ pliku wej¶ciowego `%s'

source: Reducing arg_max (%ld) to arg_size (%ld)
pl: Zmniejszanie arg_max (%ld) do arg_size (%ld)

source: Your environment variables take up %ld bytes
pl: Zmienne ¶rodowiskowe zajmuj± %ld bajtów

source: POSIX lower and upper limits on argument length: %ld, %ld
pl: POSIX-owy dolny i górny limit na d³ugo¶æ argumentów: %ld, %ld

source: Maximum length of command we could actually use: %ld
pl: Maksymalna d³ugo¶æ polecenia, które mo¿na u¿yæ: %ld

source: Size of command buffer we are actually using: %ld
pl: Rozmiar u¿ywanego bufora polecenia: %ld

source: unmatched %s quote; by default quotes are special to xargs unless you use the -0 option
pl: niedopasowany %s znak cytowania; domy¶lnie znaki cytowania s± specjalnymi dla xargs o ile nie u¿yto opcji -0

source: double
pl: podwójny

source: single
pl: pojedynczy

source: argument line too long
pl: za d³uga linia argumentów

source: error waiting for child process
pl: b³±d podczas oczekiwania na proces potomny

source: %s: exited with status 255; aborting
pl: %s: wyszed³ ze stanem 255; zaniechanie

source: %s: stopped by signal %d
pl: %s: zatrzymany sygna³em %d

source: %s: terminated by signal %d
pl: %s: zakoñczony sygna³em %d

source: %s: invalid number for -%c option
pl: %s: b³êdna liczba dla opcji -%c

source: %s: value for -%c option should be >= %ld
pl: %s: warto¶æ dla opcji -%c powinna byæ >= %ld

source: %s: value for -%c option should be < %ld
pl: %s: warto¶æ dla opcji -%c powinna byæ < %ld

source: Usage: %s [-0prtx] [--interactive] [--null] [-d|--delimiter=delim] [-E eof-str] [-e[eof-str]] [--eof[=eof-str]] [-L max-lines] [-l[max-lines]] [--max-lines[=max-lines]] [-I replace-str] [-i[replace-str]] [--replace[=replace-str]] [-n max-args] [--max-args=max-args] [-s max-chars] [--max-chars=max-chars] [-P max-procs] [--max-procs=max-procs] [--verbose] [--exit] [--no-run-if-empty] [--arg-file=file] [--version] [--help] [command [initial-arguments]]
pl: Sk³adnia: %s [-0prtx] [--interactive] [--null] [-d|--delimiter=ogranicznik] [-E ³añc-eof] [-e[³añc-eof]] [--eof[=³añc-eof] [-L maks-linii] [-l[maks-linii]] [--max-lines[=maks-linii]] [-I ³añc-zmienn] [-i[³añc-zmienn]] [--replace[=³añc-zminn]] [-n maks-arg] [--max-args=maks-arg] [-s maks-znaków] [--max-chars=maks-znaków] [-P maks-proc] [--max-procs=maks-proc] [--verbose] [--exit] [--no-run-if-empty] [--arg-file=plik] [--version] [--help] [polecenie [pocz±tkowe-argumenty]]
