Repository: msysgit/msys
Catalog: msys/packages/diffutils/2.8.7/po/*.po
Languages: cs, pl

source: -m --merge Output merged file instead of ed script (default -A).
cs: -m --merge Vypí¹e spojený soubor místo ed skriptu (implicitnì -A).
pl: -m -merge Wypisanie po³±czonych plików zamiast komend ed-a (domy¶lnie -A).

source: -L LABEL --label=LABEL Use LABEL instead of file name.
cs: -L POPIS --label=POPIS Pou¾ije POPIS místo jména souboru.
pl: -L ETYKIETA --label=ETYKIETA U¿ycie ETYKIETY zamiast nazwy pliku.

source: -i Append `w' and `q' commands to ed scripts.
cs: -i Pøidá pøíkazy `w' a `q' do skriptù pro ed.
pl: -i Dodanie komendy `w' i `q' do komend ed-a.

source: --diff-program=PROGRAM Use PROGRAM to compare files.
cs: --diff-program=PROGRAM Pou¾ij PROGRAM k porovnání souborù.
pl: --diff-program=PROGRAM U¿ycie PROGRAMU do porównania plików.

source: Usage: %s [OPTION]... MYFILE OLDFILE YOURFILE
cs: Pou¾ití: %s [PØEPÍNAÈ]... MUJSOUBOR STARYSOUBOR VASSOUBOR
pl: U¿ycie: %s [OPCJA]... MÓJ_PLIK STARY_PLIK TWÓJ_PLIK

source: Compare three files line by line.
cs: Porovnání tøí souborù øádek po øádku.
pl: Porównanie trzech plików linia po linii.

source: internal error: screwup in format of diff blocks
cs: vnitøní chyba: chyba ve formátu diff blokù
pl: b³ad wewnêtrzny: spieprzony format bloków diff

source: %s: diff failed:
cs: %s: diff selhal:
pl: %s: diff nie zadzia³a³:

source: internal error: invalid diff type in process_diff
cs: vnitøní chyba: nesprávný typ diffu v process_diff
pl: b³±d wewnêtrzny: b³êdny typ diff w process_diff

source: invalid diff format; invalid change separator
cs: neplatný formát diff souboru; neplatný oddìlovaè zmìny
pl: b³êdny format diff; b³êdny separator zmian

source: invalid diff format; incomplete last line
cs: neplatný formát diff souboru; nekompletní poslední øádek
pl: b³êdny format diff; niekompletna ostatnia linia

source: subsidiary program `%s' not found
cs: pomocný program `%s' nebyl nalezen
pl: nie znaleziono programu pomocniczego `%s'

source: subsidiary program `%s' failed
cs: pomocný program `%s' selhal
pl: nie zadzia³a³ program pomocniczy `%s'

source: invalid diff format; incorrect leading line chars
cs: neplatný formát diff souboru; nesprávné úvodní znaky na øádku
pl: b³êdny format diff; nieprawid³owe znaki na pocz±tku linii

source: internal error: invalid diff type passed to output
cs: vnitøní chyba: nesprávný typ diffu pro výstup
pl: b³±d wenwêtrzny: b³êdny typ diff-a przekazany na wyj¶cie

source: input file shrank
cs: vstupní soubor se zmen¹il
pl: plik wej¶ciowy siê zmiejszy³

source: cannot compare file names `%s' and `%s'
cs: nemohu porovnat jména souborù `%s' a `%s'
pl: nie mo¿na porównaæ nazw plików `%s' i `%s'

source: -o FILE --output=FILE Operate interactively, sending output to FILE.
cs: -o SOUBOR --output=SOUBOR Interaktivní práce, výstup pùjde do SOUBORu.
pl: -o PLIK --output=PLIK Tryb interakcyjny, wyniki wysy³ane do PLIKu.

source: -i --ignore-case Consider upper- and lower-case to be the same.
cs: -i --ignore-case Nerozli¹uje velká a malá písmena.
pl: -i --ignore-case Traktowanie ma³ych i wielkich liter tak samo.

source: -W --ignore-all-space Ignore all white space.
cs: -W --ignore-all-space Ignoruje v¹echny mezery.
pl: -W --ignore-all-space Ignorowanie wszystkich znaków odstêpu.

source: -w NUM --width=NUM Output at most NUM (default 130) print columns.
cs: -w POÈ --width=POÈ Vypí¹e maximálnì POÈ (implicitnì 130) znakù na øádek.

source: -l --left-column Output only the left column of common lines.
cs: -l --left-column Vypí¹e pouze levý sloupec spoleèných øádkù.
pl: -I --left-column Wypisanie tylko lewej kolumny dla wspólnych linii.

source: -s --suppress-common-lines Do not output common lines.
cs: -s --suppress-common-lines Nevypisuje shodné øádky.
pl: -s --suppress-common-lines Bez wypisania wspólnych linii.

source: -H --speed-large-files Assume large files and many scattered small changes.
cs: -H --speed-large-files Pøedpokládá velké soubory a mnoho rozptýlených drobných zmìn.
pl: -H --speed-large-files Du¿e pliki i rozrzucone ma³e zmiany.

source: Usage: %s [OPTION]... FILE1 FILE2
cs: Pou¾ití: %s [PØEPÍNAÈ]... SOUBOR1 SOUBOR2
pl: U¿ycie: %s [OPCJA]... PLIK1 PLIK2

source: Side-by-side merge of file differences.
cs: Aplikace zmìn v souboru v módu `vedle sebe`.
pl: Interaktywne po³±czenie plików.

source: cannot interactively merge standard input
cs: interaktivnì nelze standardní vstup slouèit
pl: nie mogê interakcyjnie ³±czyæ standardowego wej¶cia

source: both files to be compared are directories
cs: oba soubory k porovnání jsou adresáøi
pl: oba maj±ce byæ porównane pliki to katalogi

source: ed: Edit then use both versions, each decorated with a header. eb: Edit then use both versions. el: Edit then use the left version. er: Edit then use the right version. e: Edit a new version. l: Use the left version. r: Use the right version. s: Silently include common lines. v: Verbosely include common lines. q: Quit.
cs: ed: Editace - pou¾ije obì verze, ka¾dou obdaøí hlavièkou. eb: Editace - pou¾ije obì verze. el: Editace - pou¾ije levou verzi. er: Editace - pou¾ije pravou verzi. e: Editace nové verze. l: Pou¾ije levou verzi. r: Pou¾ije pravou verzi. s: Vtichosti vlo¾í spoleèné øádky. v: Upozorní na vlo¾ení spoleèných øádkù. q: Ukonèení.
pl: ed: Edycja i u¿ycie obu wersji, ka¿dej z nag³ówkiem. eb: Edycja i u¿ycie obu wersji. el: iU¿ycie wersji po lewej. er: Edycja i u¿ycie wersji po prawej. e: Edycja nowej wersji. l: U¿ycie wersji po lewej. r: U¿ycie wersji po prawej. s: Do³±czenie wspólnych linii bez informoawania o tym. v: Do³±czenie wspólnych linii z podaniem informacji. q: Zakoñczenie.

source: typed memory object
pl: obiekt w pamiêci z okre¶leniem typu
