Repository: msysgit/msys
Catalog: msys/packages/diffutils/2.8.7/po/*.po
Languages: cs, pl

source: program error
cs: chyba programu
pl: b³±d programu

source: stack overflow
cs: pøeteèení zásobníku
pl: przepe³nienie stosu

source: Unknown system error
cs: Neznámá chyba systému
pl: Niezany b³±d systemu

source: regular empty file
cs: obyèejný prázdný soubor
pl: zwyk³y pusty plik

source: regular file
cs: obyèejný soubor
pl: zwyk³y plik

source: directory
cs: adresáø
pl: katalog

source: block special file
cs: speciální blokový soubor
pl: specjalny plik blokowy

source: character special file
cs: speciální znakový soubor
pl: specjalny plik znakowy

source: fifo
cs: roura

source: symbolic link
cs: symbolický odkaz

source: socket
cs: soket
pl: gniazdo

source: message queue
cs: fronta zpráv
pl: kolejka komunikatów

source: semaphore
cs: semafor
pl: semafor

source: shared memory object
cs: objekt sdílené pamìti
pl: obiekt w pamiêci dzielonej

source: weird file
cs: soubor neznámého typu
pl: dziwny plik

source: %s: option `%s' is ambiguous
cs: %s: pøepínaè `%s' není jednoznaèný
pl: %s: opcja `%s' is ambiguous

source: %s: option `--%s' doesn't allow an argument
cs: %s: pøepínaè `--%s' musí být zadán bez argumentu
pl: %s: opcja `--%s' nie mo¿e mieæ argumentu

source: %s: option `%c%s' doesn't allow an argument
cs: %s: pøepínaè `%c%s' musí být zadán bez argumentu
pl: %s: opcja `%c%s' nie mo¿e mieæ argumentu

source: %s: option `%s' requires an argument
cs: %s: pøepínaè `%s' vy¾aduje argument
pl: %s: opcja `%s' wymaga argumentu

source: %s: unrecognized option `--%s'
cs: %s: neznámý pøepínaè `--%s'
pl: %s: nierozpoznana opcja `--%s'

source: %s: unrecognized option `%c%s'
cs: %s: neznámý pøepínaè `%c%s'

source: %s: illegal option -- %c
cs: %s: neznámý pøepínaè -- %c
pl: %s: nielegalna opcja -- %c

source: %s: invalid option -- %c
cs: %s: neznámý pøepínaè -- %c
pl: %s: b³êdna opcja -- %c

source: %s: option requires an argument -- %c
cs: %s: pøepínaè vy¾aduje argument -- %c
pl: %s: opcja wymaga argumentu -- %c

source: %s: option `-W %s' is ambiguous
cs: %s: pøepínaè `-W %s' není jednoznaèný
pl: %s: opcja `-W %s' jest niejednoznaczna

source: %s: option `-W %s' doesn't allow an argument
cs: %s: pøepínaè `-W %s' musí být zadán bez argumentu
pl: %s: opcja `-W %s' nie mo¿e mieæ argumentu

source: Success
cs: Hotovo
pl: Powodzenie

source: No match
cs: ®ádná shoda
pl: Nie pasuje

source: Invalid regular expression
cs: Neplatný regulární výraz
pl: Z³e wyra¿enie regularne

source: Invalid collation character
cs: Neplatný znak porovnání
pl: Zly znak zbiorczy

source: Invalid character class name
cs: Neplatné jméno tøídy znakù
pl: Z³a nazwa klasy znaków

source: Trailing backslash
cs: Koncové zpìtné lomítko
pl: Koñcowy uko¶nik odwrotny

source: Invalid back reference
cs: Neplatný zpìtný odkaz
pl: Z³y odno¶nik wstecz

source: Unmatched [ or [^
cs: Nepárová [ nebo ]^
pl: Nie sparowany [ lub [^

source: Unmatched ( or \(
cs: Nepárová ( nebo \(
pl: Nie sparowany ( lub \(

source: Unmatched \{
cs: Nepárová \{
pl: Nie sparowany \{

source: Invalid content of \{\}
cs: Neplatný obsah \{\}
pl: Z³a zawarto¶æ \{\}

source: Invalid range end
cs: Neplatný konec rozsahu
pl: Z³y koniec zakresu

source: Memory exhausted
cs: Pamì» vyèerpána
pl: Brak pamiêci

source: Invalid preceding regular expression
cs: Neplatný pøedchozí regulární výraz
pl: Z³e poprzedzj±ce wyra¿enie regularne

source: Premature end of regular expression
cs: Pøedèasný konec regulárního výrazu
pl: Przedwczesny koniec wyra¿enia regularnego

source: Regular expression too big
cs: Regulární výraz je pøíli¹ dlouhý
pl: Wyra¿enia regularne jest za du¿e

source: Unmatched ) or \)
cs: Nepárová ) nebo \)
pl: Nie sparowany ) lub \)

source: No previous regular expression
cs: Pøedchozí regulární výraz neexistuje
pl: Brak porzedniego wyra¿enia regularnego

source: memory exhausted
cs: pamì» vyèerpána
pl: brak pamiêci

source: Files %s and %s differ
cs: Soubory %s a %s jsou rùzné
pl: Pliki %s i %s ró¿ni± siê

source: No newline at end of file
cs: Chybí znak konce øádku na konci souboru
pl: Brak znaku nowej linii na koñcu pliku

source: Try `%s --help' for more information.
cs: Více informací získáte pøíkazem `%s --help'.
pl: Napisz `%s --help' ¿eby dowiedzieæ siê wiêcej.

source: invalid --ignore-initial value `%s'
cs: neplatná hodnota --ignore-inital `%s'
pl: b³êdna warto¶æ --ignore-initial `%s'

source: options -l and -s are incompatible
cs: pøepínaèe -l a -s nejsou kompatibilní
pl: sprzeczne opcje -l i -s

source: write failed
cs: zápis selhal
pl: zapis nieudany

source: standard output
cs: standardní výstup
pl: standardowe wyj¶cie

source: -b --print-bytes Print differing bytes.
cs: -b --print-bytes Vypí¹e rozdílné bajty.
pl: -b --print-chars Wypisanie ró¿ni±cych siê bajtów.

source: -i SKIP --ignore-initial=SKIP Skip the first SKIP bytes of input.
cs: -i N --ignore-initial=N Ignoruje prvních N bajtù na vstupu.
pl: -i OMIÑ --ignore-initial=OMIÑ PRzeskoczenie pierwszych OMIÑ bajtów.

source: -i SKIP1:SKIP2 --ignore-initial=SKIP1:SKIP2
cs: -i N1:N2 --ignore-initial=N1:N2
pl: -i SKOK1:SKOK2--ignore-initial=SKOK1:SKOK2

source: Skip the first SKIP1 bytes of FILE1 and the first SKIP2 bytes of FILE2.
cs: Pøeskoèí prvních N1 bajtù souboru SOUBOR1 a prvních N2 bajtù souboru SOUBOR2.
pl: Przeskoczenie pierwszych SKOK1 bajtów PLIKU1 i SKOK2 bajtów PLIKU2.

source: -l --verbose Output byte numbers and values of all differing bytes.
cs: -l --verbose Vypí¹e pozice a hodnoty v¹ech rozdílných bajtù.
pl: -I --verbose Wypisanie po³o¿eñ i kodów wszystkich ró¿ni±cych siê bajtów.

source: -n LIMIT --bytes=LIMIT Compare at most LIMIT bytes.
cs: -n LIMIT --bytes=LIMIT Porovná maximálnì LIMIT bajtù.
pl: -n LIMIT --bytes=LIMIT Porównanie najwy¿ej LIMIT bajtów.

source: -s --quiet --silent Output nothing; yield exit status only.
cs: -s --quiet --silent ®ádný výstup; vrátí pouze status.
pl: -s --quiet --silnet Bez wypisania wyników; tylko przekazanie statusu.

source: -v --version Output version info.
cs: -v --version Informace o verzi.
pl: -v --version Wypisanie informacji o wersji.

source: --help Output this help.
cs: --help Vypí¹e tuto nápovìdu.
pl: --help Wypisanie tego helpu.

source: Usage: %s [OPTION]... FILE1 [FILE2 [SKIP1 [SKIP2]]]
cs: Pou¾ití: %s [PØEPÍNAÈ]... SOUBOR1 [SOUBOR2 [SKIP1 [SKIP2]]]
pl: U¿ycie: %s [OPCJA]... PLIK1 [PLIK2 [SKOK1 [SKOK2]]]

source: Compare two files byte by byte.
cs: Porovnání dvou soborù bajt po bajtu.
pl: Porównanie plików bajt po bajcie.

source: SKIP1 and SKIP2 are the number of bytes to skip in each file.
cs: N1 a N2 udávají poèet bajtù, které budou ignorovány v ka¾dém souboru.
pl: SKOK1 i SKOK2 to liczby bajtów do pominiêcia w ka¿dym z plików.

source: SKIP values may be followed by the following multiplicative suffixes: kB 1000, K 1024, MB 1,000,000, M 1,048,576, GB 1,000,000,000, G 1,073,741,824, and so on for T, P, E, Z, Y.
cs: Hodnoty SKIP mohou být doplnìny následujícími pøíponami: kB 1000, K 1024, MB 1,000,000, M 1,048,576, GB 1,000,000,000, G 1,073,741,824, a stejnì tak i pro T, P, E, Z, Y.
pl: Po warto¶ci SKOKU mog± byæ dodane nastêpuj±ce przyrostki: kB 1000, K 1024, MB 1,000,000, M 1,048,576, GB 1,000,000,000, G 1,073,741,824, i tak dalej dla T, P, E, Z, Y.

source: If a FILE is `-' or missing, read standard input.
cs: Pokud SOUBOR bude `-' nebo nebude existovat, bude èten standardní vstup.
pl: Je¿eli PLIK to `-' lub go brak, czytane jest standardowe wej¶cie.

source: Report bugs to <bug-gnu-utils@gnu.org>.
cs: Chyby v programu oznamujte na adrese <bug-gnu-utils@gnu.org> (pouze anglicky), pøipomínky k pøekladu zasílejte na <translation-team-cs@lists.sourceforge.net> (èesky).
pl: Inofmracje o b³êdach: bug-gnu-utils@gnu.org .

source: invalid --bytes value `%s'
cs: neplatná hodnota pøepínaèe --bytes `%s'
pl: b³êdna warto¶æ --bytes `%s'

source: missing operand after `%s'
cs: po `%s' je nesprávný operand
pl: brakuj±cy argument po `%s'

source: extra operand `%s'
cs: operand `%s' je nadbyteèný
pl: nadmiarowy argument `%s'

source: %s %s differ: byte %s, line %s
cs: %s %s se li¹í: bajt %s, øádek %s
pl: %s %s ró¿ni± siê: bajt %s, linia %s

source: %s %s differ: byte %s, line %s is %3o %s %3o %s
cs: %s %s se li¹í: bajt %s, øádek %s je %3o %s %3o %s
pl: %s %s ró¿ni± siê: bajt %s, linia %s zawiera %3o %s %3o %s

source: cmp: EOF on %s
cs: cmp: EOF v %s
pl: cmp: EOF przy %s

source: invalid context length `%s'
cs: neplatná délka kontextu `%s'
pl: b³êdna d³ugo¶æ kontekstu `%s'

source: pagination not supported on this host
cs: pøestránkování není na tomto poèítaèi podporováno
pl: stronicowanie nie jest mo¿liwe na tej maszynie

source: too many file label options
cs: pøíli¹ mnoho pøepínaèù popisu souboru
pl: za du¿o opcji etykietowania plików

source: invalid width `%s'
cs: nesprávná délka `%s'
pl: b³êdna szeroko¶æ `%s'

source: conflicting width options
cs: konfliktní volby ¹íøky výstupu
pl: sprzeczne opcje szeroko¶ci

source: invalid horizon length `%s'
cs: neplatná délka obzoru `%s'
pl: b³êdna d³ugo¶æ horyzontu `%s'

source: invalid tabsize `%s'
cs: nesprávná hodnota tabsize `%s'

source: conflicting tabsize options
cs: konfliktní pøepínaèe tabsize

source: `-%ld' option is obsolete; use `-%c %ld'
cs: pøepínaè `-%ld' je zastaralý; pou¾ijte `-%c %ld'
pl: opcja `-%ld' jest przestarza³a, u¿yj `-%c %ld'

source: `-%ld' option is obsolete; omit it
cs: pøepínaè `-%ld' je zastaralý; pøeskakuji jej
pl: opcja `-%ld' jest przestarza³a, opu¶æ j±

source: --from-file and --to-file both specified
cs: parametry --from-file i to-file pou¾ity najednou
pl: równocze¶nie podane --from-file i --to-file

source: Compare files line by line.
cs: Porovnání souborù øádek po øádku.
pl: Porównanie plików kolejnymi liniami.

source: -i --ignore-case Ignore case differences in file contents.
cs: -i --ignore-case Ignoruje velikost písmen v obsahu souboru.
pl: -i --ignore-case Ignorowanie ró¿nic miêdzy wielkimi i ma³ymi literami.

source: --ignore-file-name-case Ignore case when comparing file names.
cs: --ignore-file-name-case Ignoruje velikost písmen v názvech souborù.
pl: --ignore-space-change Zignorowanie wielko¶ci liter przy porównywaniu nazw plików.

source: --no-ignore-file-name-case Consider case when comparing file names.
cs: --no-ignore-file-name-case Bere v potaz velikost písmen v názvech souborù.
pl: --no-ignore-file-name-case Uwzglêdnianie wielko¶ci liter przy porównywaniu nazw plików.

source: -E --ignore-tab-expansion Ignore changes due to tab expansion.
cs: -E --ignore-tab-expansion Ignoruje zmìny v odsazení tabelátorem.
pl: -E --ignore-tab-expansion Zignorowanie zmian spowodowanych rozwiniêciem TABów.

source: -b --ignore-space-change Ignore changes in the amount of white space.
cs: -b --ignore-space-change Ignoruje zmìny v poètu mezer.
pl: -b --ignore-space-change Zignorowanie zmian ilo¶ci znaków odstêpu.

source: -w --ignore-all-space Ignore all white space.
cs: -w --ignore-all-space Ignoruje v¹echny mezery.
pl: -w --ignore-all-space Zignorowanie znaków odstêpu.

source: -B --ignore-blank-lines Ignore changes whose lines are all blank.
cs: -B --ignore-blank-lines Ignoruje zmìny v pøípadì prázdných øádkù.
pl: -B --ignore-blank-lines Zignorowanie zmian ilo¶ci pustych linii.

source: -I RE --ignore-matching-lines=RE Ignore changes whose lines all match RE.
cs: -I RV --ignore-matching-lines=RV Ignoruje zmìny na v¹ech øádcích odpovídajících RV.
pl: -I RE --ignore-matching-lines=RE Zignorowanie zmian w liniach pasuj±cych do RE.

source: --strip-trailing-cr Strip trailing carriage return on input.
cs: --strip-trailing-cr Odstraní ukonèovací znak CR na vstupu.
pl: --strip-trailing-cr Pominiêcie znaków nowej linii na wej¶ciu.

source: --binary Read and write data in binary mode.
cs: --binary Ète a zapisuje data v binárním re¾imu.
pl: --binary Czytanie i zapisywanie danych binarnie.

source: -a --text Treat all files as text.
cs: -a --text Pokládá v¹echny soubory za text.
pl: -a --text Traktowanie plików jako tekstowych.

source: -c -C NUM --context[=NUM] Output NUM (default 3) lines of copied context. -u -U NUM --unified[=NUM] Output NUM (default 3) lines of unified context. --label LABEL Use LABEL instead of file name. -p --show-c-function Show which C function each change is in. -F RE --show-function-line=RE Show the most recent line matching RE.
cs: -c -C POÈ --context[=POÈ] Vypí¹e POÈ (implicitnì 3) øádky kopírovaného kontextu. -u -U POÈ --unified[=POÈ] Vypí¹e POÈ (implicitnì 3) øádky sjednoceného kontextu. -L POPIS --label POPIS Pou¾ije POPIS místo jména souboru. -p --show-c-function U ka¾dé zmìny vypí¹e jméno C funkce, ve které se tato zmìna nachází. -F RV --show-function-line=RV Vypí¹e nejnovìj¹í øádky odpovídající RV.
pl: -c -C ILE --context[=ILE] Skopiowanie ILE (domy¶lnie 2) linii kontekstu. -u -U ILE --unified[=ILE] ILE (domy¶lnie 2) linii zunifikowanego kontekstu. --label ETYKIETA U¿ycie ETYKIETY zamiast nazwy pilku. -p --show-c-function Wskazanie funkcji C, w których s± zmiany. -F RE --show-function-line=RE Pokazanie ostatniej linii pasuj±cej do RE.

source: -q --brief Output only whether files differ.
cs: -q --brief Výstup pouze pøi rozdílných souborech.
pl: -q --brief Wypisanie wyniku tylko gdy pliki siê ró¿ni±.

source: -e --ed Output an ed script.
cs: -e --ed Vytvoøí skript pro ed.
pl: -e --ed Wynik w postaci komend ed-a

source: --normal Output a normal diff.
cs: --normal Výstup bude v normálním diff formátu.
pl: --normal Wynik w postaci zwyk³ego diff-a.

source: -n --rcs Output an RCS format diff.
cs: -n --rcs Výstup bude ve formátu RCS diff.
pl: -n --rcs Wynik w postaci diff-a z RCS.

source: -y --side-by-side Output in two columns. -W NUM --width=NUM Output at most NUM (default 130) print columns. --left-column Output only the left column of common lines. --suppress-common-lines Do not output common lines.
cs: -y --side-by-side Výstup ve dvou sloupcích. -W POÈ --width=POÈ Vypí¹e maximálnì POÈ (implicitnì 130) znakù na øádek. --left-column Vypí¹e pouze levý sloupec spoleèných øádkù. --suppress-common-lines Nevypí¹e spoleèné øádky.
pl: -y --side-by-side Wynik w dwóch kolumnach. -W ILE --width=ILE Wypisanie najwy¿ej ILE (domy¶nie 130) znaków w linii. --left-column Wypisanie tylko lewej kolumny dla wspólnych linii. --suppress-common-lines Bez wypisywania wspólnych linii.

source: -D NAME --ifdef=NAME Output merged file to show `#ifdef NAME' diffs.
cs: -D JMENO --ifdef=JMENO Vypí¹e slouèený soubor s rozdíly `#ifdef JMENO'.
pl: -D NAZWA --ifdef=NAZWA Wypisanie po³±czonego pliu dla pokazania ró¿nic w `#ifdef NAZWA'.

source: --GTYPE-group-format=GFMT Similar, but format GTYPE input groups with GFMT.
cs: --GTYPE-group-format=FMTS Podobné, ale formátuje vstupní skupiny GTYPE podle FMTS.
pl: --TYPG-group-format=GFMT Podobnie, ale z u¿yciem GFMT do sformatowania grup wej¶ciowych type TYPG

source: --line-format=LFMT Similar, but format all input lines with LFMT.
cs: --line-format=FMTR Podobnì, ale formátuje v¹echny vstupní øádky podle FMTR.
pl: --line-format=LFMT Podobnie, ale z u¿yciem LFMT do sformatowania linii wej¶ciowych.

source: --LTYPE-line-format=LFMT Similar, but format LTYPE input lines with LFMT.
cs: --LTYPE-line-format=FMTR Podobné, ale formátuje vstupní øádky LTYPE podle FMTR.
pl: --TYPL-group-format=LFMT Podobnie, ale z u¿yciem LFMT do sformatowania grup wej¶ciowych typu TYPL

source: LTYPE is `old', `new', or `unchanged'. GTYPE is LTYPE or `changed'.
cs: LTYPE je `starý', `nový' nebo `nezmìnìn'. GTYPE je LTYPE nebo `zmìnìn'.
pl: TYPL to `old', `news' lub `unchanged'. TYPG to TYPL lub `changed'.

source: GFMT may contain: %< lines from FILE1 %> lines from FILE2 %= lines common to FILE1 and FILE2 %[-][WIDTH][.[PREC]]{doxX}LETTER printf-style spec for LETTER LETTERs are as follows for new group, lower case for old group: F first line number L last line number N number of lines = L-F+1 E F-1 M L+1
cs: GFMT mù¾e obsahovat: %< øádky ze SOUBOR1 %> øádky ze SOUBOR2 %= øádky spoleèné pro SOUBOR1 i SOUBOR2 %[-][DELKA][.[PRES]]{doxX}ZNAK formát stylu printf pro ZNAK ZNAKy dále jsou pro novou skupinu, malými písmeny pro starou skupinu: F èíslo prvního øádku L èíslo posledního øádku N poèet øádkù = L-F+1 E F-1 M L+1
pl: GFMT mo¿e zawieraæ: %< linie z PLIKU1 %> linie z PLIKU2 %= linie wspólne dla PLIKU1 i PLIKU2 %[-][SZER][.[DOK£]]{doxX}LITERA specyfikacja w stylu printf dla LITERY LITERY s± nastêpuj±ce dla nowej grupy (ma³e dla starej grupy): F numer pierwszej linii L numer ostatniej linii N ilo¶æ linii = L-F+1 E F-1 M L+1

source: LFMT may contain: %L contents of line %l contents of line, excluding any trailing newline %[-][WIDTH][.[PREC]]{doxX}n printf-style spec for input line number
cs: LFMT mù¾e obsahovat: %L obsah øádku %l obsah øádku, s vyjímkou znaku konce øádku %[-][©ÍØKA][.[PØES]]{doxX}c formát stylu printf pro èíslo vstupního øádku
pl: LFMT mo¿e zawieraæ: %L zawarto¶æ linii %l zawarto¶c linii, z wy³±czeniem znaku nowej linii %[-][SZER][.[DOK£]]{doxX}n specyfikacjê numeru linii w stylu printf

source: Either GFMT or LFMT may contain: %% % %c'C' the single character C %c'\OOO' the character with octal code OOO
cs: Jeden z GFMT nebo LFMT mù¾e obsahovat: %% % %c'C' jeden znak C %c'\000' znak s osmièkovým kódem 000
pl: GFMT i LFMT mog± zawieraæ: %% % %c'C' pojedyñczy znak C %c'\OOO' znak o kodzie ósemkowym OOO

source: -l --paginate Pass the output through `pr' to paginate it.
cs: -l --paginate Výstup projde pøes `pr' pro pøestránkování.
pl: -I --paginate Przepuszczenie wyniku przez `pr' ¿eby go stronnicowaæ.

source: -t --expand-tabs Expand tabs to spaces in output.
cs: -t --expand-tabs Ve výstupu pøevede tabulátory na mezery.
pl: -t --expand-tabs Rozwiniêcie TABów w spacje w wyniku.

source: -T --initial-tab Make tabs line up by prepending a tab.
cs: -T --initial-tab Na zaèátek øádkù se vlo¾í tabulátor.
pl: -T --initial-tab Wyrównanie linii przez u¿ycie TABów.

source: --tabsize=NUM Tab stops are every NUM (default 8) print columns.
cs: --tabsize=POÈ Tab zastavuje ka¾dých POÈ (implicitnì 8) tiskových sloupcù.

source: -r --recursive Recursively compare any subdirectories found.
cs: -r --recursive Rekurzívní porovnání v¹ech nalezených podadresáøù.
pl: -r --recursive Porównanie podkatalogów rekurencyjnie.

source: -N --new-file Treat absent files as empty.
cs: -N --new-file Neexistující soubory pova¾uje za prázdné.
pl: -N --new-file Traktowanie brakuj±cych plików jak pustych.

source: --unidirectional-new-file Treat absent first files as empty.
cs: --unidirectional-new-file Pøi porovnávání adresáøù pova¾uje neexistující soubory v prvém adresáøi za prázdné.
pl: --unidirectional-new-file Traktowanie brakuj±cych pierwszych plików w pierwszym zestawie jako pustych.

source: -s --report-identical-files Report when two files are the same.
cs: -s --report-identical-files Uvede pouze shodné soubory.
pl: -s --report-identical-files Informowanie gdy dwa pliki s± takie same.

source: -x PAT --exclude=PAT Exclude files that match PAT.
cs: -x VZOR --exclude=VZOR Vynechá soubory odpovídající VZORu.
pl: -x WZÓR --exclude=WZÓR Wykluczenie plików pasuj±cych do WZORu.

source: -X FILE --exclude-from=FILE Exclude files that match any pattern in FILE.
cs: -X SOUBOR --exclude-from=SOUBOR Vynechá soubory, které odpovídají libovolnému vzorku ze SOUBORu.
pl: -X PLIK --exclude-from=PLIK Pominiêcie plików pasuj±cych do wzorców w PLIKu.

source: -S FILE --starting-file=FILE Start with FILE when comparing directories.
cs: -S SOUBOR --starting-file=SOUBOR Pøi porovnávání adresáøù zaène souborem SOUBOR.
pl: -S PLIK --starting-file=PLIK Zacznij od PLIKu przy porównywaniu katalogów.

source: --from-file=FILE1 Compare FILE1 to all operands. FILE1 can be a directory.
cs: --from-file=SOUBOR1 Porovná SOUBOR1 se v¹emi operandy. SOUBOR1 mù¾e být adresáø.
pl: --from-file=PLIK1 Porównanie PLIKU1 z wszystkimi argumentami. PLIK1 mo¿e byæ katalogiem.

source: --to-file=FILE2 Compare all operands to FILE2. FILE2 can be a directory.
cs: --to-file=SOUBOR2 Porovná v¹echny operandy se SOUBOR2. SOUBOR2 mù¾e být adresáø.
pl: --to-file=PLIK2 Porównanie wszystkich argumentów z PLIKIEM2. PLIK2 mo¿e byæ katalogiem.

source: --horizon-lines=NUM Keep NUM lines of the common prefix and suffix.
cs: --horizon-lines=POÈET Ponechá POÈET shodných øádkù pøedpony a pøípony.
pl: --horizon-lines=ILE Zostawienie ILE linii wspólnego przedrostka i przyrostka.

source: -d --minimal Try hard to find a smaller set of changes.
cs: -d --minimal Pokusí se nalézt nejmen¹í sadu zmìn.
pl: -d --minimal Usi³owanie znalezienia mniejszego zbioru zmian.

source: --speed-large-files Assume large files and many scattered small changes.
cs: --speed-large-files Pøedpokládá velké soubory a mnoho rozptýlených drobných zmìn.
pl: --speed-large-files Du¿e pliki i rozrzucone ma³e zmiany.

source: FILES are `FILE1 FILE2' or `DIR1 DIR2' or `DIR FILE...' or `FILE... DIR'.
cs: SOUBORY jsou `SOUBOR1 SOUBOR2' nebo `ADRESAR1 ADRESAR2' nebo `ADRESAR SOUBOR...' nebo `SOUBOR... ADRESAR'.
pl: PLIKI to `PLIK1 PLIK2' albo `KATALOG1 KATALOG2' albo `KATALOG PLIK...' albo PLIK... KATALOG'.

source: If --from-file or --to-file is given, there are no restrictions on FILES.
cs: Pokud je uveden --from-file nebo --to-file, pak nejsou u SOUBORù ¾ádná omezení.
pl: Je¿eli u¿yta jest opcja --from-file albo --to-file, nie ma ograniczeñ co do PLIKÓW.

source: If a FILE is `-', read standard input.
cs: Pokud SOUBOR bude `-', bude èten standardní vstup.
pl: Je¿eli PLIK to `-', czytane jest standardowe wej¶cie.

source: Usage: %s [OPTION]... FILES
cs: Pou¾ití: %s [PØEPÍNAÈ]... SOUBORY
pl: U¿ycie: %s [OPCJA]... PLIKI

source: conflicting %s option value `%s'
cs: pro pøepínaè %s konfliktní hodnota `%s'
pl: sprzeczna warto¶æ opcji %s: `%s'

source: conflicting output style options
cs: konfliktní pøepínaèe pro styl výstupu
pl: sprzeczne opcje stylu wyniku

source: Only in %s: %s
cs: Pouze v %s: %s
pl: Tylko w %s: %s

source: cannot compare `-' to a directory
cs: `-' s adresáøem nelze porovnat
pl: nie mo¿na porównaæ `-' z katalogiem

source: -D option not supported with directories
cs: -D pøepínaè nepodporuje práci s adresáøi
pl: -D opcja nie dzia³a dla katalogów

source: Common subdirectories: %s and %s
cs: Spoleèné podadresáøe: %s a %s
pl: Wspólne podkatalogi: %s i %s

source: File %s is a %s while file %s is a %s
cs: Soubor %s je %s pokud soubor %s je %s
pl: Plik %s jest %s, podczas gdy plik %s jest %s

source: Files %s and %s are identical
cs: Soubory %s a %s jsou identické
pl: Pliki %s i %s s± identyczne

source: incompatible options
cs: nekompatibilní pøepínaèe
pl: niezgodne opcje

source: `-' specified for more than one input file
cs: `-' zadáno pro více ne¾ jeden vstupní soubor
pl: `-' podany dla wiêcej ni¿ jednego pliku wej¶ciowego

source: read failed
cs: ètení selhalo
pl: nieudany odczyt

source: -e --ed Output unmerged changes from OLDFILE to YOURFILE into MYFILE.
cs: -e --ed Vypí¹e nespojené zmìny ze STARYSOUBOR k VASSOUBOR do MUJSOUBOR.
pl: -e --ed Wypisanie niez³±czonych zmian miêdzy STARY_PLIK a NOWY_PLIK do MÓJ_PLIK.

source: -E --show-overlap Output unmerged changes, bracketing conflicts.
cs: -E --show-overlap Vypí¹e neslouèené zmìny, konflikty v závorkách.
pl: -E --show-overlap Wypisanie niez³±czonych zmian, konflikty w nawiasach.

source: -A --show-all Output all changes, bracketing conflicts.
cs: -A --show-all Vypí¹e v¹echny rozdíly, konflikty v závorkách.
pl: -A --show-all Wypisanie wszystkich zmian, konflikty w nawiasach.

source: -x --overlap-only Output overlapping changes.
cs: -x --overlap-only Vypí¹e pøekrývající se zmìny.
pl: -x --overlap-only Wypisanie nachodz±cych zmian.

source: -X Output overlapping changes, bracketing them.
cs: -X Vypí¹e pøekrývající se zmìny, uzavøené v závorkách.
pl: -X Wypisanie nachodz±cych zmian w nawiasach.

source: -3 --easy-only Output unmerged nonoverlapping changes.
cs: -3 --easy-only Vypí¹e neslouèené nepøekrývající se zmìny.
pl: -3 --easy-only Wypisanie niez³±czonych nienachodz±cych zmian.
